# Import Libraries

In [1]:
import pandas as pd

# Load the Dataset

In [2]:
df = pd.read_csv('messy_customer_sales_data.csv')

In [3]:
print(df)

      Customer_ID               Name  Gender         Age         City  \
0        CUST4371        Paul Wilson      m           52     KOLKATA
1        CUST5957       Jason Thomas       M  51.0 years          NaN
2        CUST3754  Brittney Martinez       F          62   hyderabad
3        CUST2934      Brenda Pierce  FEMALE          40   hyderabad
4        CUST5683    Matthew Carroll      f           41     CHENNAI
...           ...                ...     ...         ...          ...
10195   CUST10767       Robert Lewis  female  35.0 years       delhi
10196         NaN        Diane Evans       M          53   bangalore
10197    CUST6315    Joshua Martinez      m           25   hyderabad
10198    CUST4812       Sarah Miller  FEMALE          55          NaN
10199    CUST6588       David Potter  female          34   HYDERABAD

      Signup_Date Last_Purchase_Date  Purchase_Amount  Feedback_Score  \
0      26-06-2025         17-05-2025          26944.0             1.0
1      17-02-2021         22-07-2025          44152.0             2.0
2      05-11-2023         08-12-2024          31745.0             2.0
3      13-03-2022         02-10-2025          39674.0             1.0
4      05-04-2024         15-12-2024              NaN             8.0
...           ...                ...              ...             ...
10195  08-12-2020         25-01-2025          24167.0             9.0
10196  31-12-2023         07-05-2025          11639.0             7.0
10197  15-02-2022         11-01-2025          43832.0             2.0
10198  16-03-2021         14-05-2025          18827.0            10.0
10199  12-10-2020         27-06-2025          35211.0            10.0

                          Email  Phone_Number Country
0      peckvictoria@example.com    2131107701   India
1      owensanthony@example.com    1080761560   india
2            tara39@example.org    8981006345   India
3        berrynancy@example.org    8228064204   india
4          denise84@example.org    2665569480   India
...                         ...           ...     ...
10195    barrycrane@example.net    5004696571   InDia
10196    lisadennis@example.net    5200349941     IND
10197       kelli74@example.org    8147428496   India
10198        dawn84@example.org    2987564247   InDia
10199  kochjonathan@example.org    1926206725   India

[10200 rows x 12 columns]

# Describe the Dataset

In [4]:
df.shape

(10200, 12)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10200 entries, 0 to 10199
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9177 non-null   object
 1   Name                10200 non-null  object
 2   Gender              9174 non-null   object
 3   Age                 9249 non-null   object
 4   City                9184 non-null   object
 5   Signup_Date         10200 non-null  object
 6   Last_Purchase_Date  9188 non-null   object
 7   Purchase_Amount     9179 non-null   float64
 8   Feedback_Score      9177 non-null   float64
 9   Email               10200 non-null  object
 10  Phone_Number        10200 non-null  int64
 11  Country             9468 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 956.4+ KB

The output shows that the "Age" column, currently an "object" type, needs to be changed to "int64". The "Signup_Date" and "Last_Purchase_Date" columns, which are also "object" types, must be converted to "datetime".

In [6]:
df.describe()

       Purchase_Amount  Feedback_Score  Phone_Number
count     9.179000e+03     9177.000000  1.020000e+04
mean      2.909013e+04        5.479351  4.979974e+09
std       2.086971e+05        2.867123  2.902593e+09
min      -5.000000e+02        1.000000  9.208990e+05
25%       1.229500e+04        3.000000  2.449157e+09
50%       2.433000e+04        5.000000  4.988639e+09
75%       3.713000e+04        8.000000  7.510448e+09
max       9.999999e+06       10.000000  9.994402e+09

In [7]:
df.isnull().sum()

Customer_ID           1023
Name                     0
Gender                1026
Age                    951
City                  1016
Signup_Date              0
Last_Purchase_Date    1012
Purchase_Amount       1021
Feedback_Score        1023
Email                    0
Phone_Number             0
Country                732
dtype: int64

From the above code output, The dataset has a critical data quality issue due to the high volume of missing values across almost every column. Key fields like "Gender" (1026), "Customer_ID" (1023), "City" (1016), "Last_Purchase_Date" (1012), "Purchase_Amount" (1021), and "Feedback_Score" (1023) all have over 1,000 null entries, requiring attention for imputation or deletion.

In [8]:
df.isnull().sum()/len(df)*100

Customer_ID           10.029412
Name                   0.000000
Gender                10.058824
Age                    9.323529
City                   9.960784
Signup_Date            0.000000
Last_Purchase_Date     9.921569
Purchase_Amount       10.009804
Feedback_Score        10.029412
Email                  0.000000
Phone_Number           0.000000
Country                7.176471
dtype: float64

It is the percentage of missing values for every column in the Dataset

In [9]:
df[df.duplicated()].shape

(15, 12)

From the above output we can say that the dataset contains 15 duplicate rows across 12 columns.

In [10]:
df['Customer_ID'].value_counts().head(10)

Customer_ID
CUST3344     2
CUST4893     2
CUST7000     2
CUST10824    2
CUST2695     2
CUST4390     2
CUST4186     2
CUST2242     2
CUST8746     2
CUST1299     2
Name: count, dtype: int64

This is the frequency of the Customer_ID in the Transaction history.

In [11]:
df[df['Customer_ID'] == 'CUST3344']

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
4483,CUST3344,John Russell,M,65,MUMBAI,21-11-2023,10-08-2025,36235.0,8.0,sandra86@example.org,4225788150,India
6218,CUST3344,John Russell,male,65,Mumbai,21-11-2023,10-08-2025,36235.0,8.0,sandra86@example.org,4225788150,India

The customer 'John Russell' appears twice in the data. Most fields are the same, but the 'Gender' column is different ('M' vs 'male'). This shows a data entry inconsistency, which should be fixed for better analysis.

In [12]:
df[df['Customer_ID'] == 'CUST10824']

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
283,CUST10824,Whitney Ochoa,male,37,kolkata,25-02-2022,07-12-2024,13965.0,9.0,michaeldennis@example.org,4921320158,India
8584,CUST10824,Whitney Ochoa,MALE,37,Kolkata,25-02-2022,07-12-2024,13965.0,9.0,michaeldennis@example.org,4921320158,India

Also in this "Gender" column is different ('male' vs 'MALE'), all other fields are same, which goes to the data entry inconsistency, which should be fixed for better analysis.

In [13]:
for col in df.columns:
    if df[col].nunique() < 20:
        print(df[col].value_counts())
        print('-'*50)

Gender
f         1184
M         1171
m         1163
F         1157
MALE      1131
female    1128
male      1121
FEMALE    1119
Name: count, dtype: int64
--------------------------------------------------
City
Kolkata       820
Mumbai        812
Chennai       784
Bangalore     773
Hyderabad     770
Delhi         763
CHENNAI       404
KOLKATA       395
MUMBAI        393
hyderabad     384
bangalore     383
DELHI         378
delhi         369
BANGALORE     363
HYDERABAD     360
mumbai        352
chennai       343
kolkata       338
Name: count, dtype: int64
--------------------------------------------------
Feedback_Score
2.0     952
4.0     947
7.0     938
6.0     927
3.0     913
8.0     912
1.0     907
9.0     903
10.0    901
5.0     877
Name: count, dtype: int64
--------------------------------------------------
Country
India    7132
IND       793
india     772
InDia     771
Name: count, dtype: int64
--------------------------------------------------

It shows the distribution of values in categorical columns, helping us understand which categories are most common and identify any imbalances or inconsistencies in the data.

# Handling missing values

In [14]:
df.dropna(subset=['Customer_ID'], inplace = True)

In [15]:
df.shape

(9177, 12)

In [18]:
df['Age'].unique()

array(['52', '51.0 years', '62', '40', '41', nan, '18', '43.0 years',
       '40.0 years', '26', '32', '22', '59', '65', '61', '31',
       '54.0 years', '55', '69', '61.0 years', '24', '63', '19', '50',
       '56', '36', '68', '43', '38', '27', '57.0 years', '23', '25', '66',
       '28', '30', '46', '48', '20', '37', '67', '51', '35', '58', '29',
       'nan years', '39', '49', '47', '42', '44', '64', '53', '60',
       '59.0 years', '45', '21', '34', '54', '48.0 years', '46.0 years',
       '33', '57', '30.0 years', '58.0 years', '35.0 years', '34.0 years',
       '69.0 years', '250', '19.0 years', '27.0 years', '53.0 years',
       '65.0 years', '66.0 years', '44.0 years', '49.0 years',
       '25.0 years', '23.0 years', '62.0 years', '41.0 years',
       '33.0 years', '28.0 years', '22.0 years', '20.0 years',
       '42.0 years', '45.0 years', '3', '63.0 years', '37.0 years',
       '38.0 years', '55.0 years', '18.0 years', '36.0 years',
       '67.0 years', '29.0 years', '39.0 years', '31.0 years',
       '47.0 years', '52.0 years', '-10', '60.0 years', '24.0 years',
       '26.0 years', '21.0 years', '64.0 years', '50.0 years',
       '68.0 years', '32.0 years', '56.0 years'], dtype=object)

In [19]:
import re
def extract_age(age):
    age_num = re.findall('[0-9]+', str(age))
    if len(age_num) > 0 :
        return age_num[0]
    else :
        return age

df['Age'] = df['Age'].apply(lambda x : extract_age(x))

In [20]:
df['Age'].unique()

array(['52', '51', '62', '40', '41', nan, '18', '43', '26', '32', '22',
       '59', '65', '61', '31', '54', '55', '69', '24', '63', '19', '50',
       '56', '36', '68', '38', '27', '57', '23', '25', '66', '28', '30',
       '46', '48', '20', '37', '67', '35', '58', '29', 'nan years', '39',
       '49', '47', '42', '44', '64', '53', '60', '45', '21', '34', '33',
       '250', '3', '10'], dtype=object)

In [21]:
df_age = df[df['Age'] != 'nan years'] ['Age']

In [22]:
df_age

0        52
1        51
2        62
3        40
4        41
         ..
10194    40
10195    35
10197    25
10198    55
10199    34
Name: Age, Length: 9120, dtype: object

In [23]:
df_age.unique()

array(['52', '51', '62', '40', '41', nan, '18', '43', '26', '32', '22',
       '59', '65', '61', '31', '54', '55', '69', '24', '63', '19', '50',
       '56', '36', '68', '38', '27', '57', '23', '25', '66', '28', '30',
       '46', '48', '20', '37', '67', '35', '58', '29', '39', '49', '47',
       '42', '44', '64', '53', '60', '45', '21', '34', '33', '250', '3',
       '10'], dtype=object)

In [24]:
df_age.dropna().astype('int64').median()

43.0

In [25]:
age_median = int(df_age.dropna().astype('int64').median())

In [27]:
age_median

43

In [28]:
df.replace('nan years' , age_median, inplace = True)

In [30]:
df['Age'] = df['Age'].fillna(age_median)

In [31]:
df['Age'].unique()

array(['52', '51', '62', '40', '41', 43, '18', '43', '26', '32', '22',
       '59', '65', '61', '31', '54', '55', '69', '24', '63', '19', '50',
       '56', '36', '68', '38', '27', '57', '23', '25', '66', '28', '30',
       '46', '48', '20', '37', '67', '35', '58', '29', '39', '49', '47',
       '42', '44', '64', '53', '60', '45', '21', '34', '33', '250', '3',
       '10'], dtype=object)

In [79]:
age_median = df['Age'].median()
df.loc[df['Age'] > 120, 'Age'] = age_median

In [80]:
df['Age'].unique()

array([52, 51, 62, 40, 41, 43, 18, 26, 32, 22, 59, 65, 61, 31, 54, 55, 69,
       24, 63, 19, 50, 56, 36, 68, 38, 27, 57, 23, 25, 66, 28, 30, 46, 48,
       20, 37, 67, 35, 58, 29, 39, 49, 47, 42, 44, 64, 53, 60, 45, 21, 34,
       33,  3, 10])

The unrealistic age value (250) was treated as an outlier and replaced with a reasonable value or removed to ensure accurate analysis.

In [32]:
df.isnull().sum()

Customer_ID             0
Name                    0
Gender                934
Age                     0
City                  918
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount       927
Feedback_Score        905
Email                   0
Phone_Number            0
Country               664
dtype: int64

The Age column was cleaned by handling missing and invalid values.

In [34]:
df['Purchase_Amount'] = df['Purchase_Amount'].fillna(df['Purchase_Amount'].median())

In [35]:
df.isnull().sum()

Customer_ID             0
Name                    0
Gender                934
Age                     0
City                  918
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score        905
Email                   0
Phone_Number            0
Country               664
dtype: int64

Missing values in the Purchase_Amount column were handled by imputing them with the median purchase amount.

In [36]:
df['Feedback_Score'] = df['Feedback_Score'].fillna(df['Feedback_Score'].mode()[0])

In [37]:
df.isnull().sum()

Customer_ID             0
Name                    0
Gender                934
Age                     0
City                  918
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score          0
Email                   0
Phone_Number            0
Country               664
dtype: int64

Missing values in the Feedback_Score column were imputed using the mode to preserve the most common customer feedback.

In [38]:
df['Gender'] = df['Gender'].fillna(df['Gender'].mode()[0])

In [39]:
df.isnull().sum()

Customer_ID             0
Name                    0
Gender                  0
Age                     0
City                  918
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score          0
Email                   0
Phone_Number            0
Country               664
dtype: int64

Missing values in the Gender column were handled by imputing them with the mode.

In [40]:
df['City'] = df['City'].fillna(df['City'].mode()[0])

In [41]:
df.isnull().sum()

Customer_ID             0
Name                    0
Gender                  0
Age                     0
City                    0
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score          0
Email                   0
Phone_Number            0
Country               664
dtype: int64

Missing values in the City column were imputed using the mode to preserve the most common city.

In [42]:
df['Country'] = df['Country'].fillna(df['Country'].mode()[0])

In [43]:
df.isnull().sum()

Customer_ID             0
Name                    0
Gender                  0
Age                     0
City                    0
Signup_Date             0
Last_Purchase_Date    914
Purchase_Amount         0
Feedback_Score          0
Email                   0
Phone_Number            0
Country                 0
dtype: int64

Missing values in the Country column were filled using the mode to maintain the most common country in the dataset.

In [44]:
df['Last_Purchase_Date'] = df['Last_Purchase_Date'].ffill()

In [45]:
df.isnull().sum()

Customer_ID           0
Name                  0
Gender                0
Age                   0
City                  0
Signup_Date           0
Last_Purchase_Date    0
Purchase_Amount       0
Feedback_Score        0
Email                 0
Phone_Number          0
Country               0
dtype: int64

Missing values in the Last_Purchase_Date column were handled using forward fill to propagate the most recent valid date downward.

All missing values in the dataset have been identified and handled appropriately, ensuring data completeness for further analysis.

# Fixing inconsistent format

In [46]:
df['Gender'].unique()

array(['m ', 'M', 'F', 'FEMALE', 'f ', 'male', 'MALE', 'female'],
      dtype=object)

In [49]:
df['Gender'] = df['Gender'].str.lower().str.strip()

In [50]:
df['Gender'].unique()

array(['m', 'f', 'female', 'male'], dtype=object)

In [51]:
gender_mapping = {
    'm' : 'Male',
    'f' : 'Female',
    'female' : 'Female',
    'male' : 'Male'
}

In [52]:
df['Gender'] = df['Gender'].replace(gender_mapping)

In [53]:
df['Gender'].unique()

array(['Male', 'Female'], dtype=object)

The Gender column has been standardized by correcting all inconsistent entries, resulting in uniform and clean categorical data.

In [54]:
df['City'].unique()

array([' KOLKATA ', ' Kolkata ', ' hyderabad ', ' CHENNAI ', ' kolkata ',
       ' BANGALORE ', ' Hyderabad ', ' HYDERABAD ', ' Mumbai ',
       ' chennai ', ' Delhi ', ' bangalore ', ' Bangalore ', ' delhi ',
       ' Chennai ', ' MUMBAI ', ' DELHI ', ' mumbai '], dtype=object)

In [55]:
df['City'] = df['City'].str.strip().str.lower()

In [56]:
df['City'].unique()

array(['kolkata', 'hyderabad', 'chennai', 'bangalore', 'mumbai', 'delhi'],
      dtype=object)

All city names were cleaned by removing extra spaces and making all letters lowercase.

In [57]:
df['Country'].unique()

array(['India', 'india', 'InDia', 'IND'], dtype=object)

In [58]:
df['Country'] = df['Country'].str.lower()

In [59]:
df['Country'].unique()

array(['india', 'ind'], dtype=object)

In [60]:
country_mapping = {
    'ind' : 'India',
    'india' : 'India'
}

In [62]:
df['Country'] = df['Country'].replace(country_mapping)

In [63]:
df['Country'].unique()

array(['India'], dtype=object)

All inconsistent country names such as "India", "india", "InDia", and "IND" were standardized to a single value.

In [64]:
df[df.duplicated()].shape

(163, 12)

In [65]:
df.drop_duplicates(inplace = True)

In [66]:
df[df.duplicated()].shape

(0, 12)

Duplicate rows in the dataset were removed to ensure all records are unique.

In [67]:
df['Customer_ID'].value_counts()

Customer_ID
CUST3693    2
CUST6833    2
CUST5341    2
CUST1002    2
CUST9950    2
           ..
CUST7857    1
CUST3881    1
CUST1565    1
CUST9038    1
CUST5957    1
Name: count, Length: 9000, dtype: int64

In [68]:
df.drop_duplicates(subset = ['Customer_ID'], keep = 'first')

,Customer_ID,Name,Gender,Age,City,Signup_Date,Last_Purchase_Date,Purchase_Amount,Feedback_Score,Email,Phone_Number,Country
0,CUST4371,Paul Wilson,Male,52,kolkata,26-06-2025,17-05-2025,26944.0,1.0,peckvictoria@example.com,2131107701,India
1,CUST5957,Jason Thomas,Male,51,kolkata,17-02-2021,22-07-2025,44152.0,2.0,owensanthony@example.com,1080761560,India
2,CUST3754,Brittney Martinez,Female,62,hyderabad,05-11-2023,08-12-2024,31745.0,2.0,tara39@example.org,8981006345,India
3,CUST2934,Brenda Pierce,Female,40,hyderabad,13-03-2022,02-10-2025,39674.0,1.0,berrynancy@example.org,8228064204,India
4,CUST5683,Matthew Carroll,Female,41,chennai,05-04-2024,15-12-2024,24268.0,8.0,denise84@example.org,2665569480,India
...,...,...,...,...,...,...,...,...,...,...,...,...
10193,CUST6352,Isaiah Terry,Female,26,kolkata,04-03-2023,30-06-2025,43655.0,6.0,lopezleonard@example.net,7694723210,India
10194,CUST6146,Cody Thompson,Female,40,kolkata,21-08-2024,26-10-2024,35101.0,1.0,mitchellrivera@example.net,6380823112,India
10195,CUST10767,Robert Lewis,Female,35,delhi,08-12-2020,25-01-2025,24167.0,9.0,barrycrane@example.net,5004696571,India
10197,CUST6315,Joshua Martinez,Male,25,hyderabad,15-02-2022,11-01-2025,43832.0,2.0,kelli74@example.org,8147428496,India
10198,CUST4812,Sarah Miller,Female,55,kolkata,16-03-2021,14-05-2025,18827.0,10.0,dawn84@example.org,2987564247,India

In [69]:
df.shape

(9014, 12)

Duplicate records based on Customer_ID were removed, retaining only the first occurrence for each customer to ensure unique customer entries.

# Correcting data types

In [70]:
df['Age'].astype('int64')

0        52
1        51
2        62
3        40
4        41
         ..
10193    26
10194    40
10195    35
10197    25
10198    55
Name: Age, Length: 9014, dtype: int64

In [71]:
df['Signup_Date'] = pd.to_datetime(df['Signup_Date'], dayfirst=True)
df['Last_Purchase_Date'] = pd.to_datetime(df['Last_Purchase_Date'], dayfirst=True)

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9014 entries, 0 to 10198
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9014 non-null   object
 1   Name                9014 non-null   object
 2   Gender              9014 non-null   object
 3   Age                 9014 non-null   object
 4   City                9014 non-null   object
 5   Signup_Date         9014 non-null   datetime64[ns]
 6   Last_Purchase_Date  9014 non-null   datetime64[ns]
 7   Purchase_Amount     9014 non-null   float64
 8   Feedback_Score      9014 non-null   float64
 9   Email               9014 non-null   object
 10  Phone_Number        9014 non-null   int64
 11  Country             9014 non-null   object
dtypes: datetime64[ns](2), float64(2), int64(1), object(7)
memory usage: 915.5+ KB

In [73]:
age_median = df['Age'].median()

In [74]:
df['Age'] = df['Age'].fillna(age_median)

In [75]:
df['Age'] = df['Age'].astype('int64')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9014 entries, 0 to 10198
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         9014 non-null   object
 1   Name                9014 non-null   object
 2   Gender              9014 non-null   object
 3   Age                 9014 non-null   int64
 4   City                9014 non-null   object
 5   Signup_Date         9014 non-null   datetime64[ns]
 6   Last_Purchase_Date  9014 non-null   datetime64[ns]
 7   Purchase_Amount     9014 non-null   float64
 8   Feedback_Score      9014 non-null   float64
 9   Email               9014 non-null   object
 10  Phone_Number        9014 non-null   int64
 11  Country             9014 non-null   object
dtypes: datetime64[ns](2), float64(2), int64(2), object(6)
memory usage: 915.5+ KB

# Export Cleaned Dataset

In [77]:
df.to_csv('cleaned_data.csv', index=False)

The cleaned dataset was exported to a CSV file named cleaned_data.csv for further analysis or sharing.